<template>
    <div id="agreement_text">
        <h4>Условия Соглашения регулируют отношения Продавца и Клиента и содержат следующие определения:</h4>

        <p>Клиент — физическое лицо, имеющее намерение оформить и/или оформляющее Заказ на Товары, представленные на
            сайте misterio.shop.</p>

        <h4>Продавец – ИП «Misterio».</h4>

        <h4>Сайт – misterio.shop</h4>

        <p>Заказ - должным образом оформленный запрос Клиента на покупку и доставку Товара, представленного на
            Сайте.</p>

        <h4>1. Общие положения.</h4>

        <p>Настоящее Соглашение определяет условия и порядок использования Клиентов Интернет-магазина – «Откровенные
            игры».
            Продавец оставляет за собой право вносить изменения в настоящее Соглашение.
        </p>

        <h4>2. Регистрация и формление заказа.</h4>

        <p>При регистрации и/или оформлении заказов на Сайте Клиент дает согласие на получение от Продавца рассылок
            рекламно-информационного характера. Указанные рассылки содержат информацию о предстоящих акциях, розыгрышах
            и других мероприятиях Продавца.</p>

        <p>Рассылки поступают в виде электронного письма на адрес, указанный Клиентом. Рекламно-информационные
            материалы могут предоставляться в виде бумажно-полиграфической и сувенирной продукции, вкладываться в заказы
            клиентов и доставляться на указанный почтовый адрес в виде писем и посылок.</p>

        <p>Перед заказом товара, Клиент обязуется ознакомиться с правилами доставки и оплаты заказа, а также условиями
            возврата товара.</p>

        <p>В течение 2-х дней с момента получения Заказа представитель Продавца связывается с Клиентом для
            подтверждения Заявки, уточнения даты, времени и места доставки Товара.</p>

        <p>Клиент вправе отказаться от заказанного Товара в любое время до момента исполнения заказа.</p>

        <h4>3. Использование информации предоставленной Клиентом.</h4>

        <p>Продавец использует предоставленные Клиентом данные в течение всего срока регистрации Клиента на Сайте в
            целях:</p>

        <p>- для регистрации/авторизации Клиента на Сайте;</p>

        <p>- для обработки заказов Клиента и выполнения своих обязательств перед Клиентом;</p>

        <p>- для осуществления деятельности по продвижению товаров и услуг; анализа покупательских особенностей Клиента
            и предоставления персональных рекомендаций.</p>

        <p>Продавец обязуется не передавать полученную от Клиента информацию третьим лицам. Не считается нарушением
            предоставление Продавцом информации агентам и третьим лицам, действующим на основании договора с Продавцом,
            для исполнения обязательств перед Клиентом и только в рамках договоров.</p>

        <p>Для отзыва согласия на обработку персональных данных вам достаточно написать письмо на электронную почту
            <b>otkrovennieigri@mail.ru</b>.</p>
    </div>
</template>
<script>
export default {
  name: 'user-agreement-text'
}
</script>
<style scoped lang="scss">
  #agreement_text {
    color: white;
    max-width: 70vw;
    margin: 0 auto;
    text-align: left;
  }
</style>
